In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

format_dict = {'amount':'{:,}',
               'grs_amt':'{:,.2f}','net_amt':'{:,.2f}','refund':'{:,.2f}'}
year = 2022
pay_date = date.today()
pay_date

datetime.date(2022, 12, 2)

In [2]:
pay_date = date(2022, 12, 2)
pay_date

datetime.date(2022, 12, 2)

### Restart and run all

In [3]:
sql = '''
SELECT name, p_date, FORMAT(amt,2) AS amt, FORMAT(net,2) AS net, format(amt-net,2) AS refund, year, quarter AS q
FROM dividends
WHERE YEAR(p_date) = %s AND p_date <= '%s'
ORDER BY p_date DESC, name ASC'''
sql = sql % (year, pay_date)
print(sql)

SELECT name, p_date, FORMAT(amt,2) AS amt, FORMAT(net,2) AS net, format(amt-net,2) AS refund, year, quarter AS q
FROM dividends
WHERE YEAR(p_date) = 2022 AND p_date <= '2022-12-02'
ORDER BY p_date DESC, name ASC

In [4]:
dtl_by_month = pd.read_sql(sql, conpf)
dtl_by_month

       name      p_date        amt        net  refund  year  q
0   CPNREIT  2022-12-02   6,000.00   5,400.00  600.00  2022  3
1       PTT  2022-10-12   5,850.00   5,265.00  585.00  2022  2
2     PTTGC  2022-09-21   9,000.00   8,100.00  900.00  2022  2
3     WHAIR  2022-09-19   6,224.00   5,601.60  622.40  2022  2
4       IVL  2022-09-15     960.00     864.00   96.00  2022  2
..      ...         ...        ...        ...     ...   ... ..
57    WHART  2022-03-25   2,390.00   2,151.00  239.00  2021  4
58    JASIF  2022-03-21  27,500.00  27,500.00    0.00  2021  4
59    CPNCG  2022-03-04   2,222.00   1,999.80  222.20  2021  4
60      DIF  2022-03-04  15,660.00  15,660.00    0.00  2021  4
61      LPF  2022-02-15   1,719.00   1,547.10  171.90  2021  4

[62 rows x 7 columns]

In [7]:
sql = '''
SELECT YEAR(p_date) AS pay_year, SUM(amt) AS grs_amt, SUM(net) AS net_amt, SUM(amt-net) AS refund
FROM dividends
WHERE p_date <= '%s'
GROUP BY pay_year
ORDER BY pay_year DESC'''
sql = sql % pay_date
print(sql)
ttl_by_year = pd.read_sql(sql, conpf)
ttl_by_year.style.format(format_dict)

SELECT YEAR(p_date) AS pay_year, SUM(amt) AS grs_amt, SUM(net) AS net_amt, SUM(amt-net) AS refund
FROM dividends
WHERE p_date <= '2022-12-02'
GROUP BY pay_year
ORDER BY pay_year DESC